XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.AC33Mx128_Series.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>ABOV</vendor>
  <name>AC33Mx128_Series</name>
  <description>ABOV Semiconductor Motor Gen-1 Device Support, Drivers and Examples</description>
  <url>https://www.abov.co.kr/data/mds/PACK/</url>
  <supportContact>abov_fae@abov.co.kr</supportContact>
  <releases>
    <release version="1.1.4" date="2021-05-11">
            - Updated URL information
    </release>
    <release version="1.1.3" date="2021-01-13">
            - Updated AC33Mx128 Series Pack : AC33M8128, AC33M6128
            - Modified port Initialization
    </release>
  </releases>
  <keywords>
    <keyword>ABOV</keyword>
	<keyword>MOTOR</keyword>
    <keyword>AC33</keyword>
  </keywords>
  <devices>
    <family Dfamily="AC33Mx128 Series" Dvendor="ABOV Semiconductor:126">
      <processor Dcore="Cortex-M3" DcoreVersion="r1p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" />
      <description>The ABOV AC33Mx128 device family includes a high-performance controller, the ARM Cortex-M3 processor, and provides motor control and high-speed ADC functionality.
            </description>
      <!-- Subfamily : AC33Mx128 *********************************************************-->
      <subFamily DsubFamily="AC33Mx128">
        <processor Dclock="72000000" />
        <compile header="AC33Mx128\Core\include\AC33Mx128.h" />
        <debug svd="AC33Mx128\SVD\AC33Mx128.svd" />
        <algorithm name="AC33Mx128\Flashloader\ac33m8128_PFLASH.FLM" start="0x00000000" size="0x20000" default="1" />
        <feature type="VCC" n="3.00" m="5.50" />
        <feature type="Temp" n="-40" m="85" />
        <memory id="IROM1" start="0x00000000" size="0x20000" startup="1" default="1" />
        <memory id="IRAM1" start="0x20000000" size="0x3000" init="0" default="1" />
        <feature type="WDT" n="1" m="32" name="Watchdog Timer" />
        <feature type="Timer" n="6" m="16" name="Timer" />
        <feature type="PWM" n="2" m="16" name="PWM" />
        <feature type="SPI" n="2" name="SPI" />
        <feature type="ADC" n="3" m="12" name="ADC" />
        <feature type="AnalogOther" n="4" name="OPAMP" />
        <feature type="AnalogOther" n="4" name="COMP" />
        <!-- Device : AC33M8128 -->
        <device Dname="AC33M8128">
          <description>Package type 80LQFP, 80MQFP</description>
          <feature type="I2C" n="2" name="I2C" />
          <feature type="UART" n="4" name="UART" />
          <feature type="IOs" n="68" name="Inputs/Outputs" />
          <feature type="QFP" n="80" name="MQFP" />
          <feature type="QFP" n="80" name="LQFP" />
        </device>
        <!-- Device : AC33M6128 -->
        <device Dname="AC33M6128">
          <description>Package type 64LQFP</description>
          <feature type="I2C" n="1" name="I2C" />
          <feature type="UART" n="2" name="UART" />
          <feature type="IOs" n="48" name="Inputs/Outputs" />
          <feature type="QFP" n="64" name="LQFP" />
        </device>
      </subFamily>
    </family>
  </devices>
  <conditions>
	<!-- condition : AC33M8128/6128 ********************************************************-->
    <condition id="AC33Mx128 CMSIS">
      <description>AC33M8128, AC33M6128 device and CMSIS-Core</description>
      <require Tcompiler="ARMCC" />
      <require Cclass="CMSIS" Cgroup="CORE" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="AC33M8128" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="AC33M6128" />
    </condition>
  </conditions>
  <components>
	<!-- component : AC33M8128/6128 ********************************************************-->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="AC33Mx128 CMSIS">
      <description>System Startup for ABOV AC33M8128/6128 devices</description>
      <files>
        <file category="include" name="AC33Mx128\Core\include\" />
        <file category="include" name="AC33Mx128\Drivers\include\" />
        <file category="header" version="1.0.0" name="AC33Mx128\Core\include\AC33Mx128.h" attr="config" />
        <file category="source" version="1.0.0" name="AC33Mx128\Core\source\ARM\startup_AC33Mx128.s" attr="config" />
        <file category="source" version="1.0.0" name="AC33Mx128\Core\source\system_AC33Mx128.c" attr="config" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="Debug_frameWork" Cversion="1.0.0" condition="AC33Mx128 CMSIS">
      <description>AC33Mx128 debug framework</description>
      <files>
        <file category="header" name="AC33Mx128\Drivers\include\slib.h" />
        <file category="header" name="AC33Mx128\Drivers\include\debug_frmwrk.h" />
        <file category="source" name="AC33Mx128\Drivers\source\slib.c" />
        <file category="source" name="AC33Mx128\Drivers\source\debug_frmwrk.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="ADC" Cversion="1.0.0" condition="AC33Mx128 CMSIS">
      <description>AC33Mx128 ADC control</description>
      <files>
        <file category="header" name="AC33Mx128\Drivers\include\ac33mx128_adc.h" />
        <file category="source" name="AC33Mx128\Drivers\source\ac33mx128_adc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="AFE" Cversion="1.0.0" condition="AC33Mx128 CMSIS">
      <description>AC33Mx128 AFE control</description>
      <files>
        <file category="header" name="AC33Mx128\Drivers\include\ac33mx128_afe.h" />
        <file category="source" name="AC33Mx128\Drivers\source\ac33mx128_afe.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="DMA" Cversion="1.0.0" condition="AC33Mx128 CMSIS">
      <description>AC33Mx128 DMA control</description>
      <files>
        <file category="header" name="AC33Mx128\Drivers\include\ac33mx128_dmac.h" />
        <file category="source" name="AC33Mx128\Drivers\source\ac33mx128_dmac.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="GPIO" Cversion="1.0.0" condition="AC33Mx128 CMSIS">
      <description>AC33Mx128 GPIO control</description>
      <files>
        <file category="header" name="AC33Mx128\Drivers\include\ac33mx128_gpio.h" />
        <file category="source" name="AC33Mx128\Drivers\source\ac33mx128_gpio.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="I2C" Cversion="1.0.0" condition="AC33Mx128 CMSIS">
      <description>AC33Mx128 I2C control</description>
      <files>
        <file category="header" name="AC33Mx128\Drivers\include\ac33mx128_i2c.h" />
        <file category="source" name="AC33Mx128\Drivers\source\ac33mx128_i2c.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="MPWM" Cversion="1.0.0" condition="AC33Mx128 CMSIS">
      <description>AC33Mx128 MPWM control</description>
      <files>
        <file category="header" name="AC33Mx128\Drivers\include\ac33mx128_mpwm.h" />
        <file category="source" name="AC33Mx128\Drivers\source\ac33mx128_mpwm.c" />
      </files>
    </component>
