XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.AC33Mx128_Series.pdsc
    <component Cclass="Device" Cgroup="Drivers" Csub="PCU" Cversion="1.0.0" condition="AC33Mx128 CMSIS">
      <description>AC33Mx128 PCU control</description>
      <files>
        <file category="header" name="AC33Mx128\Drivers\include\ac33mx128_pcu.h" />
        <file category="source" name="AC33Mx128\Drivers\source\ac33mx128_pcu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="Power" Cversion="1.0.0" condition="AC33Mx128 CMSIS">
      <description>AC33Mx128 Power control</description>
      <files>
        <file category="header" name="AC33Mx128\Drivers\include\ac33mx128_pwr.h" />
        <file category="source" name="AC33Mx128\Drivers\source\ac33mx128_pwr.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="SCU" Cversion="1.1.0" condition="AC33Mx128 CMSIS">
      <description>AC33Mx128 SCU control</description>
      <files>
        <file category="header" name="AC33Mx128\Drivers\include\ac33mx128_scu.h" />
        <file category="source" name="AC33Mx128\Drivers\source\ac33mx128_scu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="SPI" Cversion="1.0.0" condition="AC33Mx128 CMSIS">
      <description>AC33Mx128 SPI control</description>
      <files>
        <file category="header" name="AC33Mx128\Drivers\include\ac33mx128_spi.h" />
        <file category="source" name="AC33Mx128\Drivers\source\ac33mx128_spi.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="Timer" Cversion="1.0.0" condition="AC33Mx128 CMSIS">
      <description>AC33Mx128 Timer control</description>
      <files>
        <file category="header" name="AC33Mx128\Drivers\include\ac33mx128_timer.h" />
        <file category="source" name="AC33Mx128\Drivers\source\ac33mx128_timer.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="UART" Cversion="1.0.0" condition="AC33Mx128 CMSIS">
      <description>AC33Mx128 UART control</description>
      <files>
        <file category="header" name="AC33Mx128\Drivers\include\ac33mx128_uart.h" />
        <file category="source" name="AC33Mx128\Drivers\source\ac33mx128_uart.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="WDT" Cversion="1.0.0" condition="AC33Mx128 CMSIS">
      <description>AC33Mx128 WDT control</description>
      <files>
        <file category="header" name="AC33Mx128\Drivers\include\ac33mx128_wdt.h" />
        <file category="source" name="AC33Mx128\Drivers\source\ac33mx128_wdt.c" />
      </files>
    </component>
  </components>
  <boards>
    <!-- board : AC33M8128/6128 ************************************************************-->
    <board vendor="ABOV" name="StarterKit-AC33M8128L" revision="V1.1">
      <description>StarterKit-AC33M8128L</description>
      <mountedDevice deviceIndex="0" Dvendor="ABOV Semiconductor:126" Dname="AC33M8128" />
      <compatibleDevice deviceIndex="0" Dvendor="ABOV Semiconductor:126" Dname="AC33M6128" />
      <feature type="XTAL" n="8000000" />
      <feature type="PWR" n="5" name="USB Powered" />
      <feature type="PWR" n="3" m="5" name="External Supply" />
      <feature type="Button" n="2" name="Tact-buttons: User and Reset" />
      <feature type="LED" n="6" name="LEDs : D101~D106" />
	  <debugInterface adapter="A-Link (CMSIS-DAP)" connector="USB Mini 5 pin"/>
    </board>
  </boards>
  <examples>
    <!-- example : AC33M8128/6128 **********************************************************-->
    <example name="ABOV ADC burst" doc="Abstract.txt" folder="AC33Mx128\Examples\ADC\Adc_Burst">
      <description>ADC burst example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Adc_Burst.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV ADC continuous" doc="Abstract.txt" folder="AC33Mx128\Examples\ADC\Adc_Continuous">
      <description>ADC continuous example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Adc_Continuous.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV ADC interrupt" doc="Abstract.txt" folder="AC33Mx128\Examples\ADC\Adc_Interrupt">
      <description>ADC interrupt example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Adc_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV ADC polling" doc="Abstract.txt" folder="AC33Mx128\Examples\ADC\Adc_Polling">
      <description>ADC polling example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Adc_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV bit band" doc="Abstract.txt" folder="AC33Mx128\Examples\Cortex-M3\CortexM3_Bitband">
      <description>bit band example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\CortexM3_Bitband.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV privilege" doc="Abstract.txt" folder="AC33Mx128\Examples\Cortex-M3\CortexM3_Privilege">
      <description>Privilege example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\CortexM3_Privilege.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV Flash memory control" doc="Abstract.txt" folder="AC33Mx128\Examples\FMC\FMC_WriteErase">
      <description>Flash memory write/erase example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\FMC_WriteErase.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO Ext. INT." doc="Abstract.txt" folder="AC33Mx128\Examples\GPIO\Gpio_ExtInt">
      <description>GPIO external interrupt example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Gpio_ExtInt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO input" doc="Abstract.txt" folder="AC33Mx128\Examples\GPIO\Gpio_Input">
      <description>GPIO input example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Gpio_Input.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO LED blinky" doc="Abstract.txt" folder="AC33Mx128\Examples\GPIO\Gpio_LedBlinky">
      <description>GPIO LED blinky example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Gpio_LedBlinky.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV I2C" doc="Abstract.txt" folder="AC33Mx128\Examples\I2C\I2c_MasterSlave">
      <description>I2C example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\I2c_MasterSlave.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV MPWM" doc="Abstract.txt" folder="AC33Mx128\Examples\MPWM\Mpwm_Interrupt">
      <description>MPWM example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Mpwm_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV sleep mode" doc="Abstract.txt" folder="AC33Mx128\Examples\PWR\Pwr_Sleep">
      <description>Sleep mode example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Pwr_Sleep.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SPI master" doc="Abstract.txt" folder="AC33Mx128\Examples\SPI\Spi_Master">
      <description>SPI master example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Spi_Master.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SPI slave" doc="Abstract.txt" folder="AC33Mx128\Examples\SPI\Spi_Slave">
      <description>SPI slave example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Spi_Slave.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="Starter Kit - Gpio_LedBlinky" doc="Abstract.txt" folder="AC33Mx128\Examples\StarterKit\Gpio_LedBlinky">
      <description>Starter Kit - Gpio_LedBlinky (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\StartKit_Gpio_LedBlinky.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV timer capture" doc="Abstract.txt" folder="AC33Mx128\Examples\TIMER\Timer_Capture">
      <description>Timer capture example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Timer_Capture.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV timer INT." doc="Abstract.txt" folder="AC33Mx128\Examples\TIMER\Timer_MatchInterrupt">
      <description>Timer interrupt example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Timer_MatchInterrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV timer polling" doc="Abstract.txt" folder="AC33Mx128\Examples\TIMER\Timer_MatchPolling">
      <description>Timer polling example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Timer_MatchPolling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV timer one shot" doc="Abstract.txt" folder="AC33Mx128\Examples\TIMER\Timer_OneShot">
      <description>Timer one shot example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Timer_OneShot.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV timer PWM" doc="Abstract.txt" folder="AC33Mx128\Examples\TIMER\Timer_PWM">
      <description>Timer PWM example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Timer_PWM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV UART DMA" doc="Abstract.txt" folder="AC33Mx128\Examples\UART\Uart_Dma">
      <description>UART DMA example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Uart_Dma.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV UART INT." doc="Abstract.txt" folder="AC33Mx128\Examples\UART\Uart_Interrupt">
      <description>UART interrupt example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Uart_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV UART polling" doc="Abstract.txt" folder="AC33Mx128\Examples\UART\Uart_Polling">
      <description>UART polling example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Uart_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT INT." doc="Abstract.txt" folder="AC33Mx128\Examples\WDT\Wdt_Interrupt">
      <description>WDT interrupt example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Wdt_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT reset" doc="Abstract.txt" folder="AC33Mx128\Examples\WDT\Wdt_Reset">
      <description>WDT reset example (AC33M8128/6128)</description>
      <board name="StarterKit-AC33M8128L" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Wdt_Reset.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
  </examples>
</package>